The command id.
  Namespace:   Autodesk.Revit.UI
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public uint Id { get; }
  Visual Basic
Public ReadOnly Property Id As UInteger
	Get
  Visual C++
public:
property unsigned int Id {
	unsigned int get ();
}
 See Also
  RevitCommandId Class
  Autodesk.Revit.UI Namespace